{
  "backend/main.mo": "Main Motoko actor implementing authorization, publication state management (publish/unpublish), user profiles, video ideas with scheduling, and hashtag tracking using stable state and access control.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: removing sessionStorage persistence for staff code verification, displaying UnpublishedOverlay on frontend pages, and fixing republish button functionality.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration, describing UI elements, authentication flows, and data management patterns.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, defining design tokens for background, foreground, primary, secondary, accent, and chart colors.",
  "frontend/index.html": "HTML entry point for the TikTok Companion app with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, dashboard, calendar, hashtags, and settings pages, wrapped in ThemeProvider with AuthGuard protection and Toaster notifications.",
  "frontend/src/components/AuthGuard.tsx": "Authentication guard component that redirects unauthenticated users, shows loading states, and displays ProfileSetup modal for users without profiles.",
  "frontend/src/components/CalendarView.tsx": "Calendar grid component rendering month view with navigation controls, displaying scheduled videos on their respective dates with click handlers for date selection.",
  "frontend/src/components/HashtagCard.tsx": "Card component displaying hashtag name, usage count, creation date, and copy-to-clipboard button with success feedback.",
  "frontend/src/components/HashtagForm.tsx": "Form component for adding hashtags with validation, auto-formatting (adds # prefix if missing), and toast notifications on success/error.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, navigation menu (Ideas, Calendar, Hashtags), mobile menu toggle, settings dropdown, and login button integration.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/ProfileSetup.tsx": "Onboarding card component for new users to create their profile by entering their name with validation and success notifications.",
  "frontend/src/components/ScheduleDialog.tsx": "Dialog form for scheduling video ideas to specific dates, filtering unscheduled drafts and preventing past date selection.",
  "frontend/src/components/StaffCodeDialog.tsx": "Password-protected dialog for staff access verification using hardcoded code '2807' with error handling and loading states.",
  "frontend/src/components/UnpublishedOverlay.tsx": "Full-screen overlay component displaying a maintenance message when the app is temporarily unavailable.",
  "frontend/src/components/VideoIdeaCard.tsx": "Card component displaying video idea details with status badges, hashtags, scheduled/created dates, edit button, and delete confirmation dialog for drafts.",
  "frontend/src/components/VideoIdeaForm.tsx": "Form component for creating/editing video ideas with title, description, and hashtags fields. Handles validation, submission via mutation hook, and displays loading states.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes and initializes access control with admin token.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor. Returns loading states and profile data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle. Provides authentication status and identity to child components.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including user profiles, video ideas (CRUD operations), scheduling, and hashtag management. Each mutation invalidates relevant query caches on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette using OKLCH color space for light/dark themes. Defines energetic coral/orange/teal design tokens and gradient utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Calendar.tsx": "Calendar page component displaying scheduled videos in a monthly view with date range queries. Includes schedule dialog for adding videos and unpublished state overlay.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying video ideas organized by status (draft, scheduled, published) with tabs, search, and CRUD operations. Shows unpublished overlay or loading state when appropriate.",
  "frontend/src/pages/Hashtags.tsx": "Hashtags management page with search functionality, grid display of hashtag cards, and dialog for adding new hashtags. Includes empty state handling and unpublished overlay.",
  "frontend/src/pages/Landing.tsx": "Landing page with hero section, feature cards, and call-to-action buttons for getting started or viewing calendar. Shows unpublished overlay when app is in maintenance mode.",
  "frontend/src/pages/Settings.tsx": "Settings page with staff-only moderation controls for toggling app publication status (published/unpublished). Requires staff code verification to access moderation features.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including color schemes using OKLCH format, font families (Inter, Poppins), custom shadows, border radius variables, and animation keyframes for accordions and fade-in effects.",
  "project_state.json": "Project state file tracking a TikTok video content management app with 13 features including authentication, dashboard, calendar, hashtag tracking, and moderation; currently has two known issues with unpublish functionality and staff code authentication persistence."
}