{
  "backend/main.mo": "Main actor implementing user profiles, video ideas, hashtags, publication state management, and staff analytics with authorization controls using MixinAuthorization and AccessControl.",
  "backend/migration.mo": "Migration module defining OldActor and NewActor types with a run function that currently performs no transformation (identity migration).",
  "feature_evidence.json": "Feature evidence report documenting the StaffAnalyticsPanel component expansion to display metrics including total hashtags, average videos per user, top 5 hashtags, and recent user activity.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend source files including components, pages, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI elements, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the TikTok Companion application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, dashboard, calendar, hashtags, and settings pages, wrapped in ThemeProvider with Toaster for notifications.",
  "frontend/src/components/AuthGuard.tsx": "Authentication guard component that redirects unauthenticated users, shows ProfileSetup for new users, and displays loading states during initialization and profile fetching.",
  "frontend/src/components/CalendarView.tsx": "Calendar grid component rendering a monthly view with navigation controls, displaying scheduled videos on their respective dates with click handlers for date selection.",
  "frontend/src/components/HashtagCard.tsx": "Card component displaying hashtag details with name, usage count, creation date, and a copy-to-clipboard button that appears on hover with success feedback.",
  "frontend/src/components/HashtagForm.tsx": "Form component for adding new hashtags with validation, auto-formatting (adds # prefix if missing), and toast notifications for success/error states.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header, navigation menu (Ideas, Calendar, Hashtags), mobile responsive menu, settings dropdown, and login button integration.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/ProfileSetup.tsx": "Onboarding card component for new users to create their profile by entering their name with a welcoming UI featuring gradient styling.",
  "frontend/src/components/ScheduleDialog.tsx": "Dialog form for scheduling draft video ideas to specific dates using a calendar picker and dropdown selector for unscheduled videos.",
  "frontend/src/components/StaffAnalyticsPanel.tsx": "Staff-only analytics dashboard displaying platform metrics including total users, videos, hashtags, active users, and top user activity with formatted statistics cards.",
  "frontend/src/components/StaffCodeDialog.tsx": "Password-protected dialog for staff access verification using a hardcoded staff code (2807) to unlock moderation controls.",
  "frontend/src/components/UnpublishedOverlay.tsx": "Full-screen overlay component that blocks app access during maintenance, displaying a warning message about temporary unavailability.",
  "frontend/src/components/VideoIdeaCard.tsx": "Displays a video idea as a card with title, description, hashtags, status badge, and date, featuring hover effects, edit button, and delete confirmation dialog for drafts.",
  "frontend/src/components/VideoIdeaForm.tsx": "Form component for creating or editing video ideas with fields for title, description, and hashtags, using React Hook Form and toast notifications for feedback.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor with authentication, initializing access control with admin token and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient with configurable options and delegation identity management.",
  "frontend/src/hooks/useQueries.ts": "Centralized collection of React Query hooks for all backend operations including video ideas, hashtags, user profiles, statistics, and activities with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette using OKLCH color space, defining light and dark theme variables with energetic coral/orange/teal accent colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Calendar.tsx": "Calendar page component that displays a monthly calendar view of scheduled TikTok videos with date range filtering, allows scheduling new videos via dialog, and shows unpublished overlay when app is unpublished.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page component that displays video ideas organized by status tabs (all/draft/scheduled/published), provides create/edit/delete functionality via dialogs, and shows unpublished overlay when app is unpublished.",
  "frontend/src/pages/Hashtags.tsx": "Hashtags page component that displays a searchable grid of hashtags, provides add hashtag functionality via dialog, and shows unpublished overlay when app is unpublished.",
  "frontend/src/pages/Landing.tsx": "Landing page component with hero section and features overview, includes call-to-action buttons to dashboard and calendar, and shows unpublished overlay when app is unpublished.",
  "frontend/src/pages/Settings.tsx": "Settings page component with staff-gated moderation controls for publishing/unpublishing the app, includes staff code verification dialog and analytics panel for verified staff users.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup functions for sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including color schemes using OKLCH color space, font families (Inter, Poppins), custom shadows, animations, and container settings for a modern UI design system.",
  "project_state.json": "Project state tracking file for a TikTok content management app, documenting 11 implemented features including video idea management, Internet Identity authentication, content calendar, hashtag tracking, and UI customizations like hamburger menu and settings page."
}