{
  "backend/main.mo": "Main actor with user profiles, video ideas, hashtags management, authorization system via MixinAuthorization, and publication state toggle (published/unpublished) restricted to admins.",
  "backend/migration.mo": "Migration module that adds publicationState field (defaulting to #published) to existing actor state while preserving userProfiles, videoIdeas, and hashtags data.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: staff access button, staff code verification (2807), publish/unpublish toggle, and unpublished state overlay across pages.",
  "frontend-file-summaries.txt": "Summaries of frontend files including components for staff code dialog, unpublished overlay, video/hashtag management, calendar view, settings page with moderation controls, and React Query hooks for backend operations.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark mode variables for background, foreground, primary, secondary, destructive, borders, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'TikTok Companion' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, ThemeProvider, Toaster, and routes for landing, dashboard, calendar, hashtags, and settings pages with AuthGuard protection.",
  "frontend/src/components/AuthGuard.tsx": "Authentication guard component that redirects unauthenticated users to landing page, shows loading states, and displays ProfileSetup modal for users without profiles.",
  "frontend/src/components/CalendarView.tsx": "Calendar grid component displaying month view with day names, navigation controls, and scheduled videos rendered on their respective dates with click handlers.",
  "frontend/src/components/HashtagCard.tsx": "Displays a hashtag in a card with usage count, creation date, and a copy-to-clipboard button that appears on hover.",
  "frontend/src/components/HashtagForm.tsx": "Form component for adding new hashtags with automatic '#' prefix handling and loading states.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, mobile menu, authentication-aware routing to Ideas/Calendar/Hashtags, and settings dropdown.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states and query cache clearing.",
  "frontend/src/components/ProfileSetup.tsx": "First-time user onboarding form that collects the user's name and creates their profile.",
  "frontend/src/components/ScheduleDialog.tsx": "Dialog for scheduling video ideas to specific dates, showing only unscheduled draft videos with calendar date picker.",
  "frontend/src/components/StaffCodeDialog.tsx": "Password-protected dialog that verifies staff access with hardcoded code '2807' for moderation controls.",
  "frontend/src/components/UnpublishedOverlay.tsx": "Full-screen overlay that displays a maintenance message when the app is unavailable.",
  "frontend/src/components/VideoIdeaCard.tsx": "Card component displaying video idea details with status badge, hashtags, scheduled date, edit button, and delete option for drafts.",
  "frontend/src/components/VideoIdeaForm.tsx": "Form component for creating/editing video ideas with title, description, and hashtags fields. Handles validation, submission via useAddVideoIdea mutation, and displays loading states.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication via Internet Identity. Invalidates dependent queries when actor changes and initializes access control with admin token.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor. Returns loading states and the UserProfile data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle. Provides authentication status and identity to child components.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including user profiles, video ideas (CRUD operations), scheduling, and hashtags. Each mutation invalidates relevant query caches on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme color palettes using coral/orange/teal scheme. Includes utility classes for gradient backgrounds.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/Calendar.tsx": "Calendar page component displaying scheduled videos in a monthly view with stats, schedule dialog for adding videos, and unpublished state overlay. Fetches videos by date range and manages dialog state.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying video ideas organized by status (draft, scheduled, published) with tabs, search, and CRUD operations. Shows an unpublished overlay when the app is in maintenance mode.",
  "frontend/src/pages/Hashtags.tsx": "Hashtag management page with search functionality, allowing users to add, view, and organize hashtags for TikTok content. Includes empty state handling and unpublished overlay support.",
  "frontend/src/pages/Landing.tsx": "Landing page with hero section, feature highlights, and call-to-action buttons. Auto-redirects authenticated users to dashboard and displays unpublished overlay when needed.",
  "frontend/src/pages/Settings.tsx": "Settings page with staff-only moderation controls including publication state toggle (published/unpublished). Requires staff code verification stored in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including color schemes using OKLCH color space, typography fonts (Inter, Poppins), custom animations, shadows, and responsive container settings.",
  "project_state.json": "Project state metadata tracking 11 implemented features for a TikTok content management dashboard, including video idea tracking, Internet Identity authentication, content calendar, hashtag tracker, and moderation system with known build issues."
}