{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix unpublish functionality and enforce staff code entry on every access",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Remove sessionStorage persistence for staff code verification to require code '2807' entry on every Settings page access",
      "acceptanceCriteria": [
        "Staff code verification state is not stored in sessionStorage",
        "Users must enter code '2807' each time they visit Settings page",
        "Moderation controls remain locked until code is entered, even after page refresh"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StaffCodeDialog.tsx",
          "operation": "modify",
          "description": "Remove sessionStorage.setItem call that persists staff code verification state. Remove sessionStorage checks from code verification logic so that verification always requires fresh code entry."
        },
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Remove sessionStorage.getItem check for 'staffCodeVerified' from the initial state. Set isStaffVerified state to always default to false, ensuring staff code dialog appears on every Settings page visit."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Create usePublicationState hook and display UnpublishedOverlay on all pages except Settings when state is unpublished",
      "acceptanceCriteria": [
        "Create a usePublicationState hook that queries backend publication state",
        "Dashboard, Calendar, Hashtags, and Landing pages check publication state before rendering main content",
        "UnpublishedOverlay displays on affected pages when state is #unpublished",
        "Settings page always remains accessible for staff to republish the app"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePublicationState.ts",
          "operation": "create",
          "description": "Create a React Query hook that fetches the publication state from the backend using actor.getPublicationState(). Include proper loading states, actor dependency checks, and query configuration with appropriate staleTime and refetchInterval to keep state current."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Import and use the usePublicationState hook. When publication state is 'unpublished', render the UnpublishedOverlay component instead of the main dashboard content. Ensure loading states are handled properly."
        },
        {
          "path": "frontend/src/pages/Calendar.tsx",
          "operation": "modify",
          "description": "Import and use the usePublicationState hook. When publication state is 'unpublished', render the UnpublishedOverlay component instead of the calendar content. Ensure loading states are handled properly."
        },
        {
          "path": "frontend/src/pages/Hashtags.tsx",
          "operation": "modify",
          "description": "Import and use the usePublicationState hook. When publication state is 'unpublished', render the UnpublishedOverlay component instead of the hashtags content. Ensure loading states are handled properly."
        },
        {
          "path": "frontend/src/pages/Landing.tsx",
          "operation": "modify",
          "description": "Import and use the usePublicationState hook. When publication state is 'unpublished', render the UnpublishedOverlay component instead of the landing page content. Ensure loading states are handled properly."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Fix republish button to successfully change backend publication state from unpublished to published",
      "acceptanceCriteria": [
        "Clicking the Republish button in Settings triggers the setPublicationState backend method with #published",
        "Backend state changes from #unpublished to #published",
        "Button label updates to show 'Unpublish' after successful republish",
        "App becomes accessible to all users immediately after republishing",
        "Success toast notification displays confirming republish action"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useRepublish and useUnpublish mutation hooks that call actor.republish() and actor.unpublish() respectively. Include proper error handling, success toasts, and query invalidation for the publication state query to ensure UI updates immediately after state changes."
        },
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Import and use the usePublicationState hook to fetch current state. Replace the existing unpublish/republish button click handlers with calls to useRepublish and useUnpublish mutations. Update button text and state based on the current publication state from the hook. Ensure proper loading states during mutations and remove any hardcoded state management."
        }
      ]
    }
  ]
}