{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Expand staff analytics dashboard with additional metrics",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Expand the StaffAnalyticsPanel component to display new metrics including total hashtags, average videos per user, top 5 hashtags list, and recent user activity timeline",
      "acceptanceCriteria": [
        "StaffAnalyticsPanel displays total hashtags count in a stat card",
        "Panel shows average videos per user rounded to 1 decimal place",
        "Top 5 hashtags are displayed in a ranked list with their usage counts",
        "Recent user activity shows the 10 newest users with formatted timestamps",
        "All new sections maintain the existing visual design style with consistent spacing and typography",
        "Loading and error states are handled for all new data queries"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StaffAnalyticsPanel.tsx",
          "operation": "modify",
          "description": "Expand the component to display four new analytics sections: (1) total hashtags count in a stat card, (2) average videos per user rounded to 1 decimal place in a stat card, (3) top 5 most used hashtags in a ranked list showing hashtag names and usage counts, and (4) recent user activity timeline showing the 10 newest users with their names and formatted creation timestamps. Use the existing UserStatistics interface from backend.d.ts which includes totalHashtags (bigint), averageVideosPerUser (number), mostUsedHashtags (Array<Hashtag>), and recentUserActivity (Array<UserProfile>) fields. Maintain the current visual design using the same card styling, grid layout, and typography patterns. The component already fetches statistics via useGetStatistics hook, so access the new fields directly from the statistics data object. Handle loading and error states consistently with the existing implementation."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Create React Query hooks in useQueries.ts for fetching the new staff analytics data that are only called when staff verification is active",
      "acceptanceCriteria": [
        "New custom hooks follow the existing useQueries.ts patterns",
        "Hooks properly handle loading, error, and success states",
        "Queries are disabled when actor is not available",
        "Data is properly typed with TypeScript interfaces"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "The existing useGetStatistics hook already fetches all required analytics data from the backend's getStatistics method, which returns UserStatistics containing totalHashtags, averageVideosPerUser, mostUsedHashtags, and recentUserActivity fields. Verify that the hook follows the established pattern: uses React Query's useQuery with queryKey ['statistics'], calls actor.getStatistics(), is enabled only when actor is available, and properly types the return value as UserStatistics. No new hooks are required since the backend interface already provides all necessary data through the single getStatistics endpoint. Ensure the hook handles loading, error, and success states consistently with other query hooks in the file."
        }
      ]
    }
  ]
}